'''
LIGHT:
1. Написал декоратор, замеряющий время выполнение декорируемой функции.
2. Сравнил время создания генератора и списка с элементами:
    натуральные числа от 1 до 1000000 (созданные объекты оформил в виде функций).
PRO
Light +
3. Написал декоратор, замеряющий объем оперативной памяти, потребляемый декорируемой функцией.
4. Сравнил объем оперативной памяти для функции создания генератора и функции создания списка с элементами:
    натуральные числа от 1 до 1000000.

Презентация вебинара:
https://drive.google.com/open?id=1O9tBDTRJ3NnSljk7RAPRBQCiB_YB8iMC
Репозиторий GitHub:
https://github.com/MachineLearningIsEasy/python_lesson_8
'''

from datetime import datetime
import psutil
import os

def timer(func):
    #--------------------------------------
    def wapper(*args, **kwargs):
        begin_time = datetime.now()
        #--------------------------------------
        result = func(*args, **kwargs)
        #--------------------------------------
        end_time = datetime.now()
        print('#',test_num, f'Время отработки функции {func.__name__}:{end_time-begin_time}(ЧЧ:ММ:СС.милисекунд)')
        return result
    #--------------------------------------
    return wapper

def memory_used(func):
    #--------------------------------------
    def wapper(*args, **kwargs):
        proc = psutil.Process(os.getpid())
        begin_memory = proc.memory_info().rss
        #--------------------------------------
        result = func(*args, **kwargs)
        #--------------------------------------
        end_memory = proc.memory_info().rss
        print('#',test_num, f'Объём памяти, используемой функцией {func.__name__}:{end_memory-begin_memory}(в байтах)')
        return result
    #--------------------------------------
    return wapper

#Тест 1.1.:
#--------------------------------------------------------------------------------------------------------
@timer
@memory_used
def timer_mem_gen_lst_nat(num, test_num):
    for i in range(num):
        yield i
#--------------------------------------------------------------------------------------------------------

#Тест 1.2.:
#--------------------------------------------------------------------------------------------------------
@memory_used
@timer
def mem_timer_gen_lst_nat(num, test_num):
    for i in range(num):
        yield i
#--------------------------------------------------------------------------------------------------------

#Тест 2.1.:
#--------------------------------------------------------------------------------------------------------
@timer
@memory_used
def timer_mem_list_nat(num, test_num):
    result = []
    for i in range(num):
        result.append(i)
    return result
#--------------------------------------------------------------------------------------------------------

#Тест 2.2.:
#--------------------------------------------------------------------------------------------------------
@memory_used
@timer
def mem_timer_list_nat(num, test_num):
    result = []
    for i in range(num):
        result.append(i)
    return result
#--------------------------------------------------------------------------------------------------------
mem_used = 0
print('#Тест 1.1. @timer, @memory_used:')
print('#--------------------------------------------------------------------------------------------------------')
test_num = 1.1
timer_mem_gen_lst_nat(10000000, test_num)
print('#--------------------------------------------------------------------------------------------------------')
print('#Тест 1.2. @memory_used, @timer:')
print('#--------------------------------------------------------------------------------------------------------')
test_num = 1.2
mem_timer_gen_lst_nat(10000000, test_num)
print('#--------------------------------------------------------------------------------------------------------')

print('#Тест 2.1. @timer, @memory_used:')
print('#--------------------------------------------------------------------------------------------------------')
test_num = 2.1
timer_mem_list_nat(10000000, test_num)
print('#--------------------------------------------------------------------------------------------------------')
print('#Тест 2.2. @memory_used, @timer:')
print('#--------------------------------------------------------------------------------------------------------')
test_num = 2.2
mem_timer_list_nat(10000000, test_num)
print('#--------------------------------------------------------------------------------------------------------')

#РЕЗУЛЬТАТЫ ДЛЯ ВИЗУАЛЬНОГО СРАВНЕНИЯ
#Тест 1.1. @timer, @memory_used:
#--------------------------------------------------------------------------------------------------------
# 1.1 Объём памяти, используемой функцией timer_mem_gen_lst_nat:0(в байтах)
# 1.1 Время отработки функции wapper:0:00:00(ЧЧ:ММ:СС.милисекунд)
#--------------------------------------------------------------------------------------------------------
#Тест 1.2. @memory_used, @timer:
#--------------------------------------------------------------------------------------------------------
# 1.2 Время отработки функции mem_timer_gen_lst_nat:0:00:00(ЧЧ:ММ:СС.милисекунд)
# 1.2 Объём памяти, используемой функцией wapper:4096(в байтах)
#--------------------------------------------------------------------------------------------------------
#Тест 2.1. @timer, @memory_used:
#--------------------------------------------------------------------------------------------------------
# 2.1 Объём памяти, используемой функцией timer_mem_list_nat:405987328(в байтах)
# 2.1 Время отработки функции wapper:0:00:02.322133(ЧЧ:ММ:СС.милисекунд)
#--------------------------------------------------------------------------------------------------------
#Тест 2.2. @memory_used, @timer:
#--------------------------------------------------------------------------------------------------------
# 2.2 Время отработки функции mem_timer_list_nat:0:00:02.445140(ЧЧ:ММ:СС.милисекунд)
# 2.2 Объём памяти, используемой функцией wapper:405774336(в байтах)
#--------------------------------------------------------------------------------------------------------