# LIGHT:
# Необходимо реализовать модуль divisor_master.
# Все функции модуля принимают на вход натуральные числа от 1 до 1000. Модуль содержит функции:
# 1) проверка числа на простоту (простые числа - это те числа у которых делители единица и они сами);
# 2) выводит список всех делителей числа;
# 3) выводит самый большой простой делитель числа.

# PRO:
# LIGHT +
# 4) функция выводит каноническое разложение числа
# (https://zaochnik.com/spravochnik/matematika/delimost/razlozhenie-chisel-na-prostye-mnozhiteli/) на простые множители;
# 5)функция выводит самый большой делитель (не обязательно простой) числа.

