'''
LIGHT:
1) Вручную создать текстовый файл с данными (например, марка авто, модель авто, расход топлива, стоимость).
2) Создать doc шаблон, где будут использованы данные параметры.
3) Автоматически сгенерировать отчет о машине в формате doc (как в видео 7.2).
4) Создать csv файл с данными о машине.
5) Создать json файл с данными о машине.

PRO:
LIGHT +
6) Замерить время генерации отчета (время выполнения пункта 3). В каждый файл пунктов 4 и 5 добавить параметр: время, затраченное на генерацию отчета.
'''

